app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."done" = 'f'
---
  def index
    @tasks = Task.where(:done => false)

INSERT INTO "tasks" ("name", "description", "due_date", "done", "created_at", "updated_at") VALUES ('hogehoge', 'gehogehoge', '2011-07-05', 'f', '2011-07-05 09:25:18.307080', '2011-07-05 09:25:18.307080')
---
  def create
    @task = Task.create(params[:task])